AhmedDesoky14/V2X_Autoparking_GP_SourceCode/Ultrasonic Hub STM32 ECU/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define System_Reset_LED_Pin GPIO_PIN_13
#define System_Reset_LED_GPIO_Port GPIOC
#define CAN_Success_LED_Pin GPIO_PIN_14
#define CAN_Success_LED_GPIO_Port GPIOC
#define Trigger0_Pin GPIO_PIN_0
#define Trigger0_GPIO_Port GPIOA
#define Buzzer_Pin GPIO_PIN_1
#define Buzzer_GPIO_Port GPIOA
#define Trigger1_Pin GPIO_PIN_4
#define Trigger1_GPIO_Port GPIOA
#define Trigger2_Pin GPIO_PIN_6
#define Trigger2_GPIO_Port GPIOA
#define CAN_Warning_LED_Pin GPIO_PIN_1
#define CAN_Warning_LED_GPIO_Port GPIOB
#define Trigger3_Pin GPIO_PIN_13
#define Trigger3_GPIO_Port GPIOB
#define T1_CH1_US0_Pin GPIO_PIN_8
#define T1_CH1_US0_GPIO_Port GPIOA
#define T1_CH2_US1_Pin GPIO_PIN_9
#define T1_CH2_US1_GPIO_Port GPIOA
#define T4_CH1_US2_Pin GPIO_PIN_6
#define T4_CH1_US2_GPIO_Port GPIOB
#define T4_CH2_US3_Pin GPIO_PIN_7
#define T4_CH2_US3_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
